LuaVan/Luan_van/src/Documents/ProgramProposal/ProgramProposal.mdo
<?xml version="1.0" encoding="UTF-8"?>
<mdclass:Document>
  <name>ProgramProposal</name>
  <registerRecords>InformationRegister.ProgramValidity</registerRecords>
  <registerRecords>InformationRegister.ApprovalLog</registerRecords>
  <attributes>
    <name>ProposingFaculty</name>
    <type>
      <types>CatalogRef.Faculties</types>
    </type>
  </attributes>
  <attributes>
    <name>Proposer</name>
    <type>
      <types>CatalogRef.Lecturers</types>
    </type>
  </attributes>
  <attributes>
    <name>TargetProgram</name>
    <type>
      <types>CatalogRef.TrainingPrograms</types>
    </type>
  </attributes>
  <attributes>
    <name>ProposalSummary</name>
    <type>
      <types>String</types>
      <stringQualifiers>
        <length>1024</length>
      </stringQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>Status</name>
    <type>
      <types>EnumRef.ProgramStatuses</types>
    </type>
  </attributes>
</mdclass:Document>

LuaVan/Luan_van/src/InformationRegisters/ProgramValidity/ProgramValidity.mdo
<?xml version="1.0" encoding="UTF-8"?>
<mdclass:InformationRegister>
  <name>ProgramValidity</name>
  <informationRegisterPeriodicity>Day</informationRegisterPeriodicity>
  <writeMode>RecorderSubordinate</writeMode>
  <dimensions>
    <name>TrainingProgram</name>
    <type>
      <types>CatalogRef.TrainingPrograms</types>
    </type>
  </dimensions>
  <resources>
    <name>Status</name>
    <type>
      <types>EnumRef.ProgramStatuses</types>
    </type>
  </resources>
  <attributes>
    <name>IssuanceDecision</name>
    <type>
      <types>CatalogRef.Decisions</types>
    </type>
  </attributes>
  <attributes>
    <name>Note</name>
    <type>
      <types>String</types>
      <stringQualifiers>
        <length>250</length>
      </stringQualifiers>
    </type>
  </attributes>
</mdclass:InformationRegister>

LuaVan/Luan_van/src/Documents/ProgramProposal/ObjectModule.bsl
////////////////////////////////////////////////////////////////////////////////
// ProgramProposal - Object Module
// - FillCheckProcessing: validate fields trước khi post
// - Posting: ghi vào IR ProgramValidity + sync Catalog.TrainingPrograms.Status
////////////////////////////////////////////////////////////////////////////////

Procedure FillCheckProcessing(Cancel, CheckedAttributes)
	If TargetProgram.IsEmpty() Then
		Msg = New UserMessage();
		Msg.Text = "CTĐT đề xuất bắt buộc.";
		Msg.Field = "TargetProgram";
		Msg.Message();
		Cancel = True;
	EndIf;
	If Proposer.IsEmpty() Then
		Msg = New UserMessage();
		Msg.Text = "Người đề xuất bắt buộc.";
		Msg.Field = "Proposer";
		Msg.Message();
		Cancel = True;
	EndIf;
EndProcedure

Procedure Posting(Cancel, PostingMode)
	ResolvedStatus = ?(Status.IsEmpty(), Enums.ProgramStatuses.UnderReview, Status);

	// 1. Ghi IR ProgramValidity
	RegisterRecords.ProgramValidity.Write = True;
	Record = RegisterRecords.ProgramValidity.Add();
	Record.Period = Date;
	Record.TrainingProgram = TargetProgram;
	Record.Status = ResolvedStatus;
	Record.Note = ProposalSummary;

	// 2. Sync Catalog.TrainingPrograms.Status (cached current state)
	UpdateProgramStatus(TargetProgram, ResolvedStatus);
EndProcedure

Procedure UpdateProgramStatus(ProgramRef, NewStatus)
	If ProgramRef.IsEmpty() Then
		Return;
	EndIf;
	ProgObj = ProgramRef.GetObject();
	If ProgObj <> Undefined Then
		ProgObj.Status = NewStatus;
		ProgObj.Write();
	EndIf;
EndProcedure
